Revit 2027 API
PanelScheduleData.UpdateIsSectionHidden Method
 Update if this section is hidden or not
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateIsSectionHidden(
	SectionType sectionType,
	bool bHide
)
Public Sub UpdateIsSectionHidden (
	sectionType As SectionType,
	bHide As Boolean
)
public:
void UpdateIsSectionHidden(
	SectionType sectionType,
	bool bHide
)
member UpdateIsSectionHidden :
        sectionType : SectionType *
        bHide : bool -> unit
Parameters
sectionType SectionType
 The Section Type
bHide Boolean
 Whether to hide this section or not
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace